# დაწერეთ პროგრამა, რომლის მეშვეობითაც შეიტანთ ნებისმიერ რიცხვს. პროგრამამ შეამოწმოს,
# თუ შეყვანილი რიცხვი 10-ის ჯერადია, დაბეჭდოს “რიცხვი ბოლოვდება 0-ით”,
# თუ არადა დაბეჭდოს “რიცხვი არ ბოლოვდება 0-ით”.
# (გაითვალისწინეთ: 10-ის ჯერადი ნიშნავს რომ 10-ზე გაყოფისას ნაშთი არის 0).

my_num = int(input("Enter a number: "))

my_divider = 10


def check_division(num, divider):
    if num % 10 == 0:
        print("რიცხვი ბოლოვდება 0-ით")
    else:
        print("რიცხვი არ ბოლოვდება 0-ით")


check_division(my_num, my_divider)
